spec/fixtures/payments/create/unauthorized.yml

---
http_interactions:
- request:
    method: post
    uri: https://dev.bitex.la:3000/api/merchants/payments
    body:
      encoding: UTF-8
      string: '{"data":{"type":"merchants/payments","attributes":{"type":"merchants/payments","amount":100,"currency":1,"keep":10,"callback_url":"https://myawesomesite.com/webhook","customer_reference":"Purchase
        at My Store","merchant_reference":"Sale id: 2212"}}}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Authorization:
      - we_dont_care
      Version:
      - '2.0'
      Content-Type:
      - application/vnd.api+json
      Accept:
      - application/vnd.api+json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 401
      message: Unauthorized
    headers:
      X-Frame-Options:
      - SAMEORIGIN
      X-Xss-Protection:
      - 1; mode=block
      X-Content-Type-Options:
      - nosniff
      Content-Type:
      - application/vnd.api+json; charset=utf-8
      Cache-Control:
      - no-cache
      X-Request-Id:
      - 37056d99-0cb8-4a19-acbd-898c02779bfc
      X-Runtime:
      - '21.892291'
    body:
      encoding: UTF-8
      string: '{"error":"Invalid Api Key"}'
    http_version: 
  recorded_at: Tue, 06 Nov 2018 20:06:15 GMT
recorded_with: VCR 4.0.0
